esp8266/Arduino/libraries/esp8266/examples/HwdtStackDump/hwdt_app_entry.cpp
/*
 *   Copyright 2020 Michael Hightower
 *
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *       http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 */

/*
 * As far as I know, there is no way to get called for a Hardware WDT. I assume
 * it generates a form of reset that occurs at a low level that cannot be
 * trapped. Debugging an HWDT can be quite challenging.
 *
 * This module writes a stack dump to the serial port after a Hardware Watchdog
 * Timer has struck and a new boot cycle has begun. By making adjustments to the
 * stack, we can avoid crash stack data being overwritten by this tool,
 * the Boot ROM and the bootloader.
 *
 * We are using the method defined for `core_esp8266_app_entry_noextra4k.cpp` to
 * load an alternate `app_entry_redefinable()`. For details on this method, see
 * comments in `core_esp8266_main.cpp's app_entry()`.
 *
 * Using this tools alternate `app_entry_redefinable()` we can gain control
 * before the SDK is started. And dump what is left of the "sys" and "cont"
 * stacks.
 *
 * By making some adjustments to start of the stack pointer, at the entry to
 * `app_entry_redefinable()`, and also to the stack pointer passed to the SDK,
 * we can preserve the stack during an HWDT event.
 *
 * To use, just place this file in the sketch directory before opening the
 * project and build and upload your sketch. That should be enough to get it
 * included in your sketch. If that does not work, then add a call to:
 *    `void enable_debug_hwdt_at_link_time (void);`
 * in `setup()`. This tool prints to the serial port at the default serial port
 * speed set by the Boot ROM. On a Hardware WDT reset that port speed is
 * 115200 bps. If your needs differ, see the HWDT_UART_SPEED option below.
 *
 * More on crystal differences and data rates:
 *     When the ESP8266 restarts because of a Hardware WDT reset, the port speed
 *     defaults to 115200. This will be the speed, even if you have a 26MHz or
 *     40MHz Crystal. If you would like to use a different data rate, use the
 *     option HWDT_UART_SPEED described below.
 *
 *     The Boot ROM initially sets the UART clock divisor to support a data rate
 *     of 115200 bps with the assumption that it has a 40MHz crystal. When a
 *     26MHz crystal is used instead, the resulting error gives us a real rate
 *     of 74880 bps and printing is garbled at first, until the CPU clock's PLL
 *     is adjusted by the NONOS SDK. While CH_PD and EST_RST bring the CPU back
 *     to this state of underclocking with a 26MHz crystal, the Hardware WDT
 *     reset does not appear to do the same. The UART continues to be clocked at
 *     a rate to support a device at 115200 bps. Thus, allowing us to see the
 *     old cryptic WDT message along with our new stack dump.
 *
 *
 * When you get a stack dump, copy-paste it into the "ESP Exception Decoder".
 * Since we don't have a SP, we see a lot more stuff in the report. Start at the
 * bottom and work your way up. At this time I have not had a lot of practice
 * using this tool.  TODO: Update description with more details when available.
 *
 *
 *
 * Possible Issues/Thoughts/Improvements:
 *
 * I wonder if the eboot could be changed to use at stack pointer beginning at
 * 0x3fffeb30. This would allow for a value near 640 for ROM_STACK_SIZE.
 *
 * If a problem should arise with some data elements being corrupted during
 * reboot, would it be possible to move their DRAM location higher in memory.
 *
 */

/*____________________________________________________________________________*/
/*                                                                            */
/*                          Configuration Options                             */
/*____________________________________________________________________________*/


/*
 * DEBUG_HWDT
 *
 * Enables this debug tool for printing a Hardware WDT stack dump at restart.
 *
 */
 #define DEBUG_HWDT


/*
 * DEBUG_HWDT_NO4KEXTRA
 *
 * This option will leave more of the system stack available for the stack dump.
 * A problem we have with the "4K extra" option, is it pushes the system stack
 * up into the ROM's BSS area which gets zeroed at reboot by the Boot ROM.
 *
 * Using this option has the effect of taking 4K of DRAM away from the heap,
 * which gets used for the "cont" stack. Leaving an extra 4K on the "sys" stack,
 * that is clear of the ROM's BSS area. This allows for a more complete "sys"
 * stack dump. The choice here can depend on where you are crashing.
 *
 * Because we don't know where the crash occurs, this option prints two stack
 * dumps, one for "cont" (user stack) and one for "sys" (NONOS SDK).
 *
 * In contrast, if the hang is happening on the "cont" stack, you don't need a
 * complete stack dump of the "sys" stack. You can omit this define and have an
 * extra 4K in the heap.
 *
 */
#define DEBUG_HWDT_NO4KEXTRA


/*
 * HWDT_UART_SPEED
 *
 * This option alters the UART serial speed used for printing the Hardware WDT
 * reset stack dump. Without this option on an HWDT reset, the existing default
 * speed of 115200 bps will be used. If you are using this default speed, you
 * can skip this option and save on the IRAM space. Note this option only
 * changes the speed while this module is printing.
 *
 * For more confusion on the serial port speed, see "More on crystal differences
 * and data rates" in the comments at the top.
 *
 */
 // #define HWDT_UART_SPEED (74880)
 // #define HWDT_UART_SPEED (115200)
 // #define HWDT_UART_SPEED (230400)


/*
 * HWDT_PRINT_GREETING
 *
 * Prints a simple introduction to let you know this tool is active and in the
 * build. At power-on, this may not be viewable on some devices. The crystal
 * has to be 40Mhz for this to work w/o using the HWDT_UART_SPEED option above.
 * May not be worth the cost in IRAM.
 *
 * EDIT: There is something different in the UART setup after a flash upload. I
 * am unable to print using the same code that works for Power-on and an EXT_RST
 * at any other time. After the SDK has run a 2nd EXT_RST will show the greeting
 * message.
 *
 * EDIT2: Seems to work better now. Placed delays around calls to
 * uart_div_modify(). Leave these comments until I have more experience with
 * this change.
 *
 */
 // #define HWDT_PRINT_GREETING


